connector = {
    'uk': {
        'start_message': '# ###   Ласкаво просимо!   ### #',
        'informer': {
            'menu': 'Ласкаво просимо до головного меню!',
            'catalog': 'Оберіть категорію вашої професії:',
            'subcatalog': 'Оберіть, ким ви бажаете працювати:',
            'browse': 'Ви не створили ще не обнієї вакансії!',
            'create': 'Бажаєшь створити нову вакансію? Я тобі допоможу!',
            'favorite': 'В тебе поки що не має уподобань(',
            'profile': 'Твій особистий профіль!',
            'about': 'Це інформація о том, хто створив цей бот!',
            'support': 'Я можу тобі чимось допомогти?',
        },

        'button': {
            'contact': '📱 Мій номер',
            'menu': {
                'catalog': '🗃️ Оголошення',
                'browse': '📌 Мои оголошення',
                'create': '🆕 Створити оголошення',
                'favorites': '⭐️ Обране',
                'profile': '🧑‍💻 Профіль',
                'about': 'ℹ️ Про нас',
                'support': '⚙️ Тех. підтримка',
            },
            'back': 'Назад',
            'exit': 'Вихід',
            'create': 'Создать',
        },

        'message': {
            'authorized': 'Вы вже є у системі.',
            'contact': 'Дуже добре! Мы тебе зареєстрували у системі.',
        },
    },
}