connector = {
    'uk': {
        'start_message': 'Привіт 👋🏻\n\n🤖 Хто я такий?\nЯ бот - помічник, який допомагатиме тобі знайти ідеальне '
                         'робоче місце або підібрати найкращих кандидатів для вашого бізнесу. Я допоможу тобі стати '
                         'частиною успішної команди або знайти фахівця своєї мрії.\n\n📌 Давай не будемо довго чекати '
                         'і почнемо наш пошук прямо зараз!\n\n➡️ Для того щоб я зміг зареєструвати тебе в системі, '
                         'нижче натисни на кнопку "Поділитися номером 📱"',

        'message': {
            'registration': {
                'contact': 'Вітаю тебе 🎉\n\nЯ успішно зареєстрував тебе в системі AdsWork!\n\n📌 Якщо у тебе '
                           'виникнуть питання, ти можеш звернутися до "⚙️ Технічної підтримки" та отримати повноцінну '
                           'допомогу від фахівців AdsWork.',
            },

            'menu': {
                'menu': '🧭 Головне меню',
                'catalog': '⬇️ Обери сферу твоєї діяльності:',
                'subcatalog': '⬇️ Обери, ким ти бажаєш працювати:',
                'all': '❎ Зараз немає активних вакансій!',
                'your': '❎ Ти не створив ще жодної вакансії!',
                'liked': '❎ В тебе немає обраних вакансій!',
                'profile': 'Твій особистий профіль!',
                'about': 'Це інформація о том, хто створив цей бот!',
                'admin': '⚠️ Це панель модератора!',
                'complaint': '✅ Все добре. Порущень немає!',
            },

            'confirm_user': {
                'create': 'Ти бажаєшь створити нову вакансію?',
                'update': 'Ти бажаєшь змінити цю вакансію?',
                'activate': 'Ти бажаєшь активувати цю вакансію?',
                'deactivate': 'Ти бажаєшь деактивувати цю вакансію?',
                'delete': 'Ти бажаєшь назавжди видалити цю вакансію?',
            },

            'confirm_admin': {
                'blocked': 'Ти бажаєшь заблокувати цього користовача?',
                'activate': 'Ти бажаєшь активувати цю вакансію?',
                'deactivate': 'Ти бажаєшь деактивувати цю вакансію?',
            },

            'vacancy': {
                'create': {
                    'catalog': 'Обери сферу діяльності твоеї вакансії.',
                    'subcatalog': 'Обери спеціальність, на яку ти шукаєш фахівця.',
                    'name': 'Дай короту назву своеї вакансії.\n'
                            'Наприклад: "Диспетчер у службу таксі"\n\n'
                            '📍 Назва не повинна бути менше 3-х та більше 60 символів!',
                    'description': 'Дай детальний опис своеї вакансії.\n\n'
                                   '📍 Опис не повинен бути менше 50 та більше 2000 символів!',
                    'requirement': 'Опиши вимоги для твого кандидата.\n\n'
                                   '📍 Вимоги не повинні бути менше 10 та більше 1000 символів!',
                    'employment': 'Яка зайнятість у твого кандидата?',
                    'experience': 'У кандидата має бути досвід на цій посаді?',
                    'remote': 'Чи є можливість працювати віддалено?',
                    'language': 'Чи потрібно знати іноземну мову?',
                    'foreigner': 'Чи є можливість працювати іноземцю?',
                    'disability': 'Чи є можливість працювати інваліду?',
                    'salary': 'Яка зарплата очікує вашого кандидата?\n'
                              'Зарплата буде відображатися у валюті: "УкраЇнська гривня"!\n\n'
                              '✅ Приклад, як можно вказати: 25000\n'
                              '❌ Приклад, як НЕ можно вказати: 25000.00',
                    'region': 'Оберыть область, де знаходится ваша компанія.',
                    'city': 'Оберыть місто, де знаходится ваша компанія.',
                    'finish': 'Вітаю тебе 🎉\n\nТи успішно створив вакансію в системі AdsWork! Вона вже опублікована '
                              'та відображається потенційним кандидатам.\n\n📌 Пам\'ятай, вакансія активна лише 30 '
                              'днів, після чого вона деактивується і вже не буде відображатися у інших користувачів. '
                              'Для того щоб її знову відображати, потрібно її активувати!',
                    'exit': '❌ Ти повністю відмінив створення вакансії!',
                },

                'update': {
                    'add': '\n\nАбо натисни "____", щоб залишити старе!',
                    'finish': 'Твоя вакансія була змінена!',
                    'exit': 'Ви повністю відмінили зміну!',
                },
            },
        },

        'button': {
            'contact': 'Поділитися номером 📱',
            'menu': {
                'catalog': '🗃️ Вакансії',
                'browse': '📌 Мої вакансії',
                'create': '🆕 Створити вакансію',
                'favorite': '⭐️ Обране',
                'profile': '🧑‍💻 Профіль',
                'about': 'ℹ️ Про мене',
                'support': '⚙️ Тех. підтримка',
                'admin': 'Адмін панель',
            },

            'confirm_user': {
                'create': 'Створити',
                'update': 'Змінити',
                'activate': 'Активувати',
                'deactivate': 'Деактивувати',
                'delete': 'Видалити',
            },

            'confirm_admin': {
                'blocked': 'Заблокувати',
                'activate': 'Активувати',
                'deactivate': 'Деактивувати',
            },

            'skip': 'Пропустити цей крок',

            'complete': 'Повна',
            'incomplete': 'Не повна',

            'yes': '✅ Так',
            'not': '❎ Ні',

            'nochange': 'Не змінювати',

            'back': '⬅️ Назад',

            'cancel': '↪️ Скасувати',

            'exit': '🧭 Меню',
        },

        'catalog': {
            'construction': {
                'name': 'Будівництво',
                'logo': '🧱',
                'subcatalog': {
                    'cranes_man': 'Кранівник',
                    'tiler': 'Плиточник',
                    'fitter': 'Монтажник',
                    'welder': 'Зварювальник',
                    'painter': 'Маляр',
                    'plumber': 'Сантехнік',
                    'facade_man': 'Фасадник',
                    'plasterer': 'Штукатур',
                    'electrician': 'Електрик',
                    'other': 'Інше',
                },
            },
            'medical': {
                'name': 'Медицина',
                'logo': '💊',
                'subcatalog': {
                    'nurse': 'Медсестра',
                    'dentist': 'Стоматолог',
                    'pharmacist': 'Фармацевт',
                    'veterinarian': 'Ветеринар',
                    'other': 'Інше',
                },
            },
            'it': {
                'name': 'АйТі',
                'logo': '🖥',
                'subcatalog': {
                    'sysadmin': 'Сис. Админ',
                    'operator': 'Оператор ПК',
                    'developer': 'Веб Розробник',
                    'gamedev': 'Розробник ігор',
                    'repairman': 'Мастер з ремонту',
                    'other': 'Інше',
                },
            },
            'finances': {
                'name': 'Фінанси',
                'logo': '💰',
                'subcatalog': {
                    'lawyer': 'Юрист',
                    'other': 'Інше',
                },
            },
            'realestate': {
                'name': 'Нерухомість',
                'logo': '🏠',
                'subcatalog': {
                    'realtor': 'Ріелтор',
                    'broker': 'Брокер',
                    'other': 'Інше',
                },
            },
        },

        'country': {
            'uk': {
                'name': 'Україна',
                'region': {
                    'kiev': {
                        'name': 'Києвська',
                        'city': {
                            'kiev': 'Києв',
                        },
                    },
                    'odessa': {
                        'name': 'Одеська',
                        'city': {
                            'odessa': 'Одеса',
                            'izmail': 'Ізмаїл',
                            'southern': 'Южний',
                            'chernomorsk': 'Черноморськ',
                            'sarata': 'Сарата',
                        },
                    },
                    'nikolajev': {
                        'name': 'Миколаївська',
                        'city': {
                            'nikolajev': 'Миколаїв',
                            'ochakov': 'Очаків',
                        },
                    },
                    'lviv': {
                        'name': 'Львівська',
                        'city': {
                            'lviv': 'Львів',
                        },
                    },
                    'vinnytsia': {
                        'name': 'Вінницька',
                        'city': {
                            'vinnytsia': 'Вінниця',
                        },
                    },
                },
            },
        },
    },
}
