connector = {
    'uk': {
        'start_message': {
            'hello': 'Привіт',
            'caption': 'Хто я?',
            'about': 'Я бот - помічник, який допомагатиме тобі знайти ідеальне робоче місце або підібрати найкращих '
                     'кандидатів для вашого бізнесу. Я допоможу тобі стати частиною успішної команди або знайти '
                     'фахівця своєї мрії.',
            'expression': 'Давай не будемо довго чекати і почнемо наш пошук прямо зараз!',
            'stipulation': 'Щоб я зміг тебе зареєструвати в системі, нижче натисни на кнопку'
        },

        'message': {
            'registration': {
                'contact': {
                    'greeting': 'Вітаю тебе',
                    'success': 'Я успішно зареєстрував тебе в системі AdsWork!',
                    'support': 'Якщо у тебе виникнуть питання, ти можеш звернутися до нашої технічної підтримки та '
                               'отримати повноцінну допомогу від фахівців AdsWork.',
                },
            },

            'menu': {
                'menu': 'Головне меню',
                'catalog': 'Обери сферу твоєї діяльності:',
                'subcatalog': 'Обери бажану професію:',
                'all': 'Зараз немає активних вакансій',
                'your': 'Ти не створив ще жодної вакансії',
                'liked': 'В тебе немає обраних вакансій',
                'admin': 'Це панель модератора',
                'complaint': 'Зараз порушень немає',
            },

            'profile': {
                'settings': 'Налаштування твого профілю',
                'caption': 'Це інформація про тебе',
                'name': 'Твоє ім\'я:',
                'phone': 'Твій номер:',
                'country': 'Країна пошуку:',
                'language': 'Мова інтерфейсу:',
                'vacancy': {
                    'has': {
                        'activate': 'Активних вакансій:',
                        'deactivate': 'Не активних вакансій:',
                    },
                    'not': 'В тебе ще немає вакансій',
                },
                'create': 'Дата реєстрації:',
            },

            'settings': {
                'name': 'Напиши своє нове ім\'я',
                'finish': {
                    'change': 'Ти змінив своє ім\'я',
                    'nochange': 'Ти написав теж саме ім\'я',
                },
                'exit': {
                    'create': '❌ Ти повністю відмінив створення ім\'я!',
                    'change': '❌ Ви повністю відмінили зміну ім\'я!'
                },
            },

            'about': 'Це інформація о том, хто створив цей бот!',

            'vacancy': {
                'add': '\n\nАбо натисни "____", щоб залишити старе!',
                'catalog': 'Обери сферу діяльності твоеї вакансії.',
                'subcatalog': 'Обери спеціальність, на яку ти шукаєш фахівця.',
                'name': 'Дай короту назву своеї вакансії.\n'
                        'Наприклад: "Диспетчер у службу таксі"\n\n'
                        '📍 Назва не повинна бути менше 3-х та більше 60 символів!',
                'description': 'Дай детальний опис своеї вакансії.\n\n'
                               '📍 Опис не повинен бути менше 50 та більше 2000 символів!',
                'requirement': 'Опиши вимоги для твого кандидата.\n\n'
                               '📍 Вимоги не повинні бути менше 10 та більше 1000 символів!',
                'employment': 'Яка зайнятість у твого кандидата?',
                'experience': 'У кандидата має бути досвід на цій посаді?',
                'remote': 'Чи є можливість працювати віддалено?',
                'language': 'Чи потрібно знати іноземну мову?',
                'foreigner': 'Чи є можливість працювати іноземцю?',
                'disability': 'Чи є можливість працювати інваліду?',
                'salary': 'Яка зарплата очікує вашого кандидата?\n'
                          'Зарплата буде відображатися у валюті: "УкраЇнська гривня"!\n\n'
                          '✅ Приклад, як можно вказати: 25000\n'
                          '❌ Приклад, як НЕ можно вказати: 25000.00',
                'region': 'Оберыть область, де знаходится ваша компанія.',
                'city': 'Оберыть місто, де знаходится ваша компанія.',
                'finish': {
                    'create': 'Вітаю тебе 🎉\n\nТи успішно створив вакансію в системі AdsWork! Вона вже опублікована '
                              'та відображається потенційним кандидатам.\n\n📌 Пам\'ятай, вакансія активна лише 30 '
                              'днів, після чого вона деактивується і вже не буде відображатися у інших користувачів. '
                              'Для того щоб її знову відображати, потрібно її активувати!',
                    'change': 'Твоя вакансія була змінена!',
                    'nochange': 'Твоя вакансія НЕ була змінена!',
                },
                'exit': {
                    'create': '❌ Ти повністю відмінив створення вакансії!',
                    'change': '❌ Ви повністю відмінили зміну вакансії!'
                },
            },

            'preview': {
                'description': 'Опис вакансії:',
                'requirement': 'Вимоги до кандидата:',
                'employment': {
                    'caption': 'Тип зайнятості:',
                    'complete': 'Повний',
                    'incomplete': 'Частковий',
                },
                'experience': {
                    'caption': 'Досвід роботи:',
                    'yes': 'Потрібен',
                    'not': 'Не потрібен',
                },
                'remote': 'Дистанційна робота',
                'language': 'Знання іноземної мови',
                'foreigner': 'Працевлаштовуємо іноземців',
                'disability': 'Працевлаштовуємо інвалідів',
                'salary': 'Зарплата:',
                'user': {
                    'caption': 'Контактні дані роботодавця:',
                    'name': 'Ім\'я роботодавця:',
                    'phone': 'Номер телефону:',
                },
                'location': {
                    'caption': 'Місце розташування:',
                    'region': 'область',
                },
            },

            'confirm': {
                'confirm_admin': {
                    'blocked': 'Ти бажаєшь заблокувати цього користовача?',
                    'activate': 'Ти бажаєшь активувати цю вакансію?',
                    'deactivate': 'Ти бажаєшь деактивувати цю вакансію?',
                },
                'confirm_user': {
                    'create': 'Ти бажаєш створити нову вакансію?',
                    'update': 'Ти бажаєш змінити цю вакансію?',
                    'activate': 'Ти бажаєш активувати цю вакансію?',
                    'deactivate': 'Ти бажаєш деактивувати цю вакансію?',
                    'delete': 'Ти бажаєш назавжди видалити цю вакансію?',
                    'complaint': 'Ти бажаєш поскаржитися на цю вакансію?',
                    'pity': 'Ти бажаєш прибрати скаргу на цю вакансію?',
                },
            },
        },

        'button': {
            'registration': {
                'contact': 'Надіслати свій номер 📱',
            },

            'menu': {
                'catalog': '🗃️ Вакансії',
                'browse': '📌 Мої вакансії',
                'create': '🆕 Створити вакансію',
                'favorite': '⭐️ Обране',
                'profile': '🧑‍💻 Профіль',
                'about': 'ℹ️ Про мене',
                'support': '⚙️ Тех. підтримка',
                'admin': 'Адмін панель',
            },

            'profile': {
                'settings': 'Налаштування профілю',
                'name': {
                    'add': 'Додати ім\'я',
                    'change': 'Змінити ім\'я'
                }
            },

            'about': {
                'donate': '💰 Задонатити',
                'channel': '📺 Наш канал',
            },

            'admin': {
                'complaint': 'Порушення',
            },

            'vacancy': {
                'preview': 'Подивитися',
                'blocked': 'Заблокувати користувача',
                'activate': 'Активувати',
                'deactivate': 'Деактивувати',
                'favorite': {
                    'add': 'Додати в обране',
                    'del': 'Прибрати з обраних',
                },
                'complaint': {
                    'add': 'Поскаржитися',
                    'del': 'Прибрати скаргу',
                },
                'update': 'Змінити',
                'delete': 'Видалити',
                'employment': {
                    'complete': 'Повна',
                    'partial': 'Часткова',
                },
                'choice': {
                    'yes': 'Так',
                    'not': 'Ні',
                },
                'nochange': 'Не змінювати',
                'city': 'Міста немає в списку',
            },

            'confirm': {
                'confirm_user': {
                    'create': 'Створити',
                    'update': 'Змінити',
                    'activate': 'Активувати',
                    'deactivate': 'Деактивувати',
                    'delete': 'Видалити',
                    'complaint': 'Поскаржитися',
                    'pity': 'Прибрати',
                },

                'confirm_admin': {
                    'blocked': 'Заблокувати',
                    'activate': 'Активувати',
                    'deactivate': 'Деактивувати',
                },
            },

            'navigation': {
                'cancel': '↪️ Скасувати',
                'back': '⬅️ Назад',
                'exit': '🧭 Меню',
            },
        },

        'catalog': {
            'construction': {
                'name': 'Будівництво',
                'logo': '🧱',
                'subcatalog': {
                    'cranes_man': 'Кранівник',
                    'tiler': 'Плиточник',
                    'fitter': 'Монтажник',
                    'welder': 'Зварювальник',
                    'painter': 'Маляр',
                    'plumber': 'Сантехнік',
                    'facade_man': 'Фасадник',
                    'plasterer': 'Штукатур',
                    'electrician': 'Електрик',
                    'other': 'Інше',
                },
            },
            'medical': {
                'name': 'Медицина',
                'logo': '💊',
                'subcatalog': {
                    'nurse': 'Медсестра',
                    'dentist': 'Стоматолог',
                    'pharmacist': 'Фармацевт',
                    'veterinarian': 'Ветеринар',
                    'other': 'Інше',
                },
            },
            'it': {
                'name': 'АйТі',
                'logo': '🖥',
                'subcatalog': {
                    'sysadmin': 'Сис. Админ',
                    'operator': 'Оператор ПК',
                    'developer': 'Веб Розробник',
                    'gamedev': 'Розробник ігор',
                    'repairman': 'Мастер з ремонту',
                    'other': 'Інше',
                },
            },
            'finances': {
                'name': 'Фінанси',
                'logo': '💰',
                'subcatalog': {
                    'lawyer': 'Юрист',
                    'other': 'Інше',
                },
            },
            'realestate': {
                'name': 'Нерухомість',
                'logo': '🏠',
                'subcatalog': {
                    'realtor': 'Ріелтор',
                    'broker': 'Брокер',
                    'other': 'Інше',
                },
            },
        },

        'country': {
            'uk': {
                'name': 'Україна',
                'region': {
                    'vinnytsia': {
                        'name': 'Вінницька',
                        'city': {
                            'vinnytsia': 'Вінниця',
                            'zhmerynka': 'Жмеринка',
                            'mogilev': 'Могилів-Подільський',
                            'khmelnyk': 'Хмільник',
                        },
                    },
                    'volyn': {
                        'name': 'Волинська',
                        'city': {
                            'vladimir': 'Володимир',
                            'kovel': 'Ковель',
                            'lutsk': 'Луцьк',
                            'novovolynsk': 'Нововолинськ',
                        },
                    },
                    'dnipropetrovsk': {
                        'name': 'Дніпропетровська',
                        'city': {
                            'dnieper': 'Дніпро',
                            'zhovti': 'Жовті Води',
                            'kamenskoye': 'Кам\'янське',
                            'krivoy': 'Кривий Ріг',
                            'manganets': 'Марганець',
                            'nikopol': 'Нікополь',
                            'novomoskovsk': 'Новомосковськ',
                            'pokrov': 'Покров',
                            'pavlograd': 'Павлоград',
                            'sinelnikovo': 'Синельникове',
                        },
                    },
                    'donetsk': {
                        'name': 'Донецька',
                        'city': {
                            'avdeevka': 'Авдіївка',
                            'bakhmut': 'Бахмут',
                            'gorlovka': 'Горлівка',
                            'donetsk': 'Донецьк',
                            'druzhkovka': 'Дружківка',
                            'yenakievo': 'Єнакієве',
                            'konstantinovka': 'Костянтинівка',
                            'kramatorsk': 'Краматорськ',
                            'makeevka': 'Макіївка',
                            'mariupol': 'Маріуполь',
                            'slavyansk': 'Слов\'янськ',
                            'snezhnoye': 'Сніжне',
                            'chistyakovo': 'Чистякове',
                            'toretsk': 'Торецк',
                            'khartsyzk': 'Харцизьк',
                            'shakhtersk': 'Шахтарськ',
                            'yasinovataya': 'Ясинувата',
                        },
                    },
                    'zakarpattia': {
                        'name': 'Закарпатська',
                        'city': {
                            'beregovo': 'Берегове',
                            'vinogradov': 'Виноградів',
                            'irshava': 'Іршава',
                            'mukachevo': 'Мукачево',
                            'uzhgorod': 'Ужгород',
                            'khust': 'Хуст',
                        },
                    },
                    'zaporizhia': {
                        'name': 'Запорізька',
                        'city': {
                            'berdyansk': 'Бердянськ',
                            'zaporozhye': 'Запоріжжя',
                            'melitopol': 'Мелітополь',
                            'tokmak': 'Токмак',
                            'energodar': 'Енергодар',
                        },
                    },
                    'zhytomyr': {
                        'name': 'Житомирська',
                        'city': {
                            'berdichev': 'Бердичів',
                            'zhytomyr': 'Житомир',
                            'korosten': 'Коростень',
                            'novograd': 'Новоград-Волинський',
                        },
                    },
                    'frankivsk': {
                        'name': 'Івано-Франківська',
                        'city': {
                            'frankivsk': 'Івано-Франківськ',
                            'kalush': 'Калуш',
                            'kolomyia': 'Коломия',
                        },
                    },
                    'kiev': {
                        'name': 'Київська',
                        'city': {
                            'church': 'Біла Церква',
                            'boryspil': 'Бориспіль',
                            'boyarka': 'Боярка',
                            'brovary': '	Бровари',
                            'bucha': 'Буча',
                            'vasilkov': 'Василькíв',
                            'vishnevoye': 'Вишневе',
                            'vyshgorod': 'Вишгород',
                            'irpen': 'Ірпінь',
                            'kiev': 'Київ',
                            'obukhov': 'Обухів',
                            'slavutich': 'Славутич',
                            'fastov': 'Фастів',
                        },
                    },
                    'kirovohrad': {
                        'name': 'Кіровоградська',
                        'city': {
                            'alexandria': 'Олександрія',
                            'kropivnitsky': 'Кропивницький',
                            'svetlovodsk': 'Світловодськ',
                        },
                    },
                    'lviv': {
                        'name': 'Львівська',
                        'city': {
                            'boryslav': 'Борислав',
                            'drohobych': 'Дрогобич',
                            'lviv': 'Львів',
                            'novoyavorovsk': 'Новояворівськ',
                            'sambor': 'Самбір',
                            'stryj': 'Стрий',
                            'chervonograd': 'Червоноград',
                        },
                    },
                    'luhansk': {
                        'name': 'Луганська',
                        'city': {
                            'alchevsk': 'Алчевськ',
                            'anthracite': 'Антрацит',
                            'bryanka': 'Брянка',
                            'sorokino': 'Сорокине',
                            'khrustalny': 'Хрустальний',
                            'lisichansk': 'Лисичанськ',
                            'lugansk': 'Луганськ',
                            'pervomaysk': 'Первомайськ',
                            'rovenky': 'Ровеньки',
                            'rubizhne': 'Рубіжне',
                            'sverdlovsk': 'Довжанськ',
                            'severodonetsk': 'Сєвєродонецьк',
                            'stakhanov': 'Кадіївка',
                        },
                    },
                    'mykolaiv': {
                        'name': 'Миколаївська',
                        'city': {
                            'voznesensk': 'Вознесенськ',
                            'mykolaiv': 'Миколаїв',
                            'pervomaysk': 'Первомайськ',
                            'yuzhnoukrainsk': 'Южноукраїнськ',
                        },
                    },
                    'odessa': {
                        'name': 'Одеська',
                        'city': {
                            'belgorod': 'Білгород-Дністровський',
                            'izmail': 'Ізмаїл',
                            'odessa': 'Одеса',
                            'podolsk': 'Подільськ',
                            'chernomorsk': 'Чорноморськ',
                            'yuzhnoye': 'Южне',
                        },
                    },
                    'poltava': {
                        'name': 'Полтавська',
                        'city': {
                            'plavni': 'Горішні Плавні',
                            'kremenchug': 'Кременчук',
                            'lubny': 'Лубни',
                            'mirgorod': 'Миргород',
                            'poltava': 'Полтава',
                        },
                    },
                    'rivne': {
                        'name': 'Рівненська',
                        'city': {
                            'dubno': 'Дубно',
                            'kostopol': 'Костопіль',
                            'varasch': 'Вараш',
                            'rivne': 'Рівне',
                        },
                    },
                    'sumy': {
                        'name': 'Сумська',
                        'city': {
                            'ochtirka': 'Охтирка',
                            'glukhov': 'Глухів',
                            'konotop': 'Конотоп',
                            'romney': 'Ромни',
                            'sumy': 'Суми',
                            'shostka': 'Шостка',
                        },
                    },
                    'ternopil': {
                        'name': 'Тернопільська',
                        'city': {
                            'kremenets': 'Кременець',
                            'ternopil': 'Тернопіль',
                            'chortkiv': 'Чортків',
                        },
                    },
                    'kharkiv': {
                        'name': 'Харківська',
                        'city': {
                            'izyum': 'Ізюм',
                            'lozovaya': 'Лозова',
                            'pervomayskiy': 'Первомайський',
                            'kharkiv': 'Харків',
                            'chuguev': 'Чугуїв',
                        },
                    },
                    'kherson': {
                        'name': 'Херсонська',
                        'city': {
                            'alyoshki': 'Олешки',
                            'kakhovka': 'Каховка',
                            'novaya': 'Нова Каховка',
                            'kherson': 'Херсон',
                        },
                    },
                    'khmelnytskyi': {
                        'name': 'Хмельницька',
                        'city': {
                            'podilskyi': 'Кам\'янець-Подільський',
                            'neteszyn': 'Нетішин',
                            'slavuta': 'Славута',
                            'starokonstantinov': 'Старокостянтинів',
                            'kmelnytskyi': 'Хмельницький',
                            'shepetivka': 'Шепетівка',
                        },
                    },
                    'cherkasy': {
                        'name': 'Черкаська',
                        'city': {
                            'zolotonosha': 'Золотоноша',
                            'smela': 'Сміла',
                            'uman': 'Умань',
                            'cherkasy': 'Черкаси',
                        },
                    },
                    'chernivtsi': {
                        'name': 'Чернівецька',
                        'city': {
                            'novodnestrovsk': 'Новодністровськ',
                            'storozyniec': 'Сторожинець',
                            'chernivtsi': 'Чернівці',
                        },
                    },
                    'chernihiv': {
                        'name': 'Чернігівська',
                        'city': {
                            'nizhyn': 'Ніжин',
                            'priluki': 'Прилуки',
                            'chernigov': 'Чернігів',
                        },
                    },
                },
            },
        },
    },
}
