connector = {
    'uk': {
        'language': {
            'uk': {
                'title': 'Українська',
                'flag': '🇺🇦',
            },
        },

        'currency': ['UAH'],

        'start_message': {
            'hello': 'Привіт',
            'caption': 'Хто я',
            'about': 'Я бот-помічник, який допоможе тобі знайти ідеальне робоче місце або підібрати найкращого '
                     'кандидата для твого бізнесу.',
            'expression': 'Давай не будемо довго чекати і почнемо наш пошук прямо зараз!',
            'stipulation': 'Щоб я зміг тебе зареєструвати в системі, нижче натисни на кнопку'
        },

        'message': {
            'registration': {
                'contact': {
                    'greeting': 'Вітаю тебе',
                    'success': 'Я успішно зареєстрував тебе в системі AdsWork',
                    'support': 'Якщо у тебе виникнуть питання, ти можеш звернутися до нашої технічної підтримки та '
                               'отримати повноцінну допомогу від фахівців AdsWork.',
                    'channel': 'Підписуйся на наш Telegram-канал та відстежуй публікацію нових вакансій у реальному '
                               'часі.',
                },
            },

            'menu': {
                'caption': {
                    'actived': 'Головне меню',
                    'blocked': 'Твій акаунт було заблоковано',
                },
                'catalog': 'Обери сферу твоєї діяльності',
                'subcatalog': 'Обери бажану професію',
                'all': 'Зараз немає активних вакансій',
                'your': 'Ти не створив ще жодної вакансії',
                'liked': 'В тебе немає обраних вакансій',
                'admin': 'Це панель модератора',
                'complaint': 'Зараз порушень немає',
            },

            'profile': {
                'caption': 'Це інформація про тебе',
                'name': 'Твоє ім\'я',
                'phone': 'Твій номер',
                'country': 'Країна пошуку',
                'language': 'Мова інтерфейсу',
                'vacancy': {
                    'has': {
                        'activate': 'Активних вакансій',
                        'deactivate': 'Не активних вакансій',
                    },
                    'not': 'В тебе ще немає вакансій',
                },
                'date': 'Дата реєстрації',

                'settings': 'Налаштування твого профілю',
            },

            'settings': {
                'name': {
                    'caption': 'Придумай собі нове ім\'я.',
                    'note': 'Ім\'я має бути не менше 2 та не більше 30 символів!',
                },
                'finish': {
                    'change': 'Ти змінив своє ім\'я',
                    'nochange': 'Ти написав теж саме ім\'я',
                },
                'cancel': {
                    'create': 'Ти відмінив створення ім\'я',
                    'change': 'Ти відмінив зміну ім\'я'
                },
            },

            'about': {
                'info': {
                    'intro': {
                        'caption': 'Хто я',
                        'note': 'Мене звати Кирило. Я є back-end розробником веб сайтів та ботів. '
                                'Також я є творцем проекту AdsWork.',
                    },
                    'social': {
                        'instagram': {
                            'caption': 'Мій профіль у Instagram',
                            'address': '@rilistx',
                        },
                    },
                    'problem': {
                        'caption': 'Що мене надихнуло',
                        'note': 'У зв\'язку з обставинами, що трапилися в моїй країні та які зачепили весь світ, '
                                'у мене з\'явилася мета допомогти людям у пошуку нової роботи.',
                    },
                    'sense': {
                        'caption': 'У чому сенс бота',
                        'note': 'Сенс цього проєкту в простоті створення і пошуку нових вакансій. '
                                'Кожен бажаючий підприємець може в кілька кліків опублікувати вакансію в '
                                'Telegram-боті, після чого її автоматично буде опубліковано в нашому '
                                'Telegram-каналі для більш активного просування.',
                    },
                    'plan': {
                        'caption': 'Які подальші дії',
                        'note': 'До моїх планів входить поступове розширення і покращення функціоналу бота '
                                'для комфортного використання його в майбутньому.',
                    },
                },

                'donate': {
                    'caption': 'Допомога проекту',
                    'note': 'Якщо у тебе є бажання підтримати цей проєкт для подальшого його процвітання, '
                            'ти можеш задонатити свої гроші за номером картки, вказаним нижче.',
                },
            },

            'moderation': {
                'blocked': {
                    'caption': 'Твій акаунт було заблоковано',
                    'info': 'Модератором було ухвалено рішення заблокувати твій акаунт у зв\'язку з грубим '
                            'порушенням правил публікації, а також усі твої вакансії були видалені з системи '
                            'AdsWork! Якщо ти бажаєш оскаржити рішення модератора, звернися до технічної '
                            'підтримки AdsWork і ми постараємось допомогти вирішити це питання.'
                },
                'activate': {
                    'caption': 'Твоя вакансія пройшла ручну модерацію',
                    'info': 'Модератор перевірив твою вакансію та прийняв рішення її схвалити.'
                },
                'deactivate': {
                    'caption': 'Твоя вакансія не пройшла ручну модерацію',
                    'info': 'Модератор перевірив твою вакансію та прийняв рішення її видалити через порушення '
                            'правил публікації.'
                },
            },

            'vacancy': {
                'catalog': {
                    'caption': 'Обери сферу діяльності для твоеї вакансії',
                    'note': 'Використовуй тільки навігацію кнопок!',
                },
                'subcatalog': {
                    'caption': 'Обери спеціальність, на яку ти шукаєш фахівця',
                    'note': 'Використовуй тільки навігацію кнопок!',
                },
                'name': {
                    'caption': 'Дай короту назву своеї вакансії',
                    'note': 'Назва має бути не менше 3 та не більше 60 символів!',
                },
                'description': {
                    'caption': 'Дай детальний опис своеї вакансії',
                    'note': 'Опис має бути не менше 50 та не більше 2000 символів!',
                },
                'requirement': {
                    'caption': 'Опиши вимоги для твого кандидата',
                    'note': 'Вимоги мають бути не менше 10 та не більше 1000 символів!',
                },
                'employment': {
                    'caption': 'Яка зайнятість буде у твого кандидата?',
                    'note': 'Використовуй тільки навігацію кнопок!',
                },
                'experience': {
                    'caption': 'У кандидата має бути досвід на цій посаді?',
                    'note': 'Використовуй тільки навігацію кнопок!',
                },
                'schedule': {
                    'caption': 'Який графік роботи у кандидата?',
                    'note': 'Використовуй тільки навігацію кнопок!',
                },
                'remote': {
                    'caption': 'Чи є можливість працювати віддалено?',
                    'note': 'Використовуй тільки навігацію кнопок!',
                },
                'language': {
                    'caption': 'Чи потрібно знати іноземну мову?',
                    'note': 'Використовуй тільки навігацію кнопок!',
                },
                'foreigner': {
                    'caption': 'Чи є можливість працювати іноземцю?',
                    'note': 'Використовуй тільки навігацію кнопок!',
                },
                'disability': {
                    'caption': 'Чи є можливість працювати інваліду?',
                    'note': 'Використовуй тільки навігацію кнопок!',
                },
                'salary': {
                    'caption': 'Яка зарплата очікує вашого кандидата?',
                    'note': 'Зарплата вказується у вигляді числа, без додавання спеціальних символів! '
                            'Валюта: «Українська гривня».',
                },
                'region': {
                    'caption': 'Оберыть область, де знаходится твоя компанія',
                    'note': 'Використовуй тільки навігацію кнопок!',
                },
                'city': {
                    'caption': 'Оберыть місто, де знаходится твоя компанія',
                    'note': 'Використовуй тільки навігацію кнопок!',
                },
                'skip': 'Якщо ти бажаєш пропустити цей крок, то натисни',
                'finish': {
                    'create': {
                        'caption': 'Ти успішно створив вакансію в системі AdsWork.',
                        'note': 'Пам\'ятай, вакансія активна лише 30 діб, після чого вона деактивується і вже не '
                                'буде відображатися у інших користувачів. Для того щоб її знову відображати, '
                                'потрібно її активувати.',
                    },
                    'change': 'Твоя вакансія була змінена',
                    'nochange': 'Змін не відбулося',
                },
                'cancel': {
                    'create': 'Ти відмінив створення вакансії',
                    'change': 'Ти відмінив зміну вакансії',
                },
                'deactivate': 'Твою вакансію було деактивовано через 30 діб!',
                'blocked': 'Твоя вакансія тимчасово заблокована та перебуває на ручній перевірці у модератора через '
                           'чисельні скарги від інших користувачів. Після перевірки, модератор тебе повідомить.',
            },

            'show': {
                'description': 'Опис вакансії',
                'requirement': 'Вимоги до кандидата',
                'employment': {
                    'caption': 'Тип зайнятості',
                    'complete': 'Повний',
                    'incomplete': 'Частковий',
                },
                'experience': {
                    'caption': 'Досвід роботи',
                    'yes': 'Потрібен',
                    'not': 'Не потрібен',
                },
                'schedule': {
                    'caption': 'Графік роботи',
                    'stable': 'Стабільний',
                    'flexible': 'Гнучкий',
                },
                'remote': 'Дистанційна робота',
                'language': 'Знання іноземної мови',
                'foreigner': 'Працевлаштовуємо іноземців',
                'disability': 'Працевлаштовуємо інвалідів',
                'salary': 'Зарплата',
                'user': {
                    'caption': 'Контактні дані роботодавця',
                    'name': 'Ім\'я роботодавця',
                    'phone': 'Номер телефону',
                },
                'location': {
                    'caption': 'Місце розташування',
                    'region': 'область',
                },
            },

            'confirm': {
                'confirm_admin': {
                    'blocked': 'Ти бажаєшь заблокувати цього користовача',
                    'activate': 'Ти бажаєшь активувати цю вакансію',
                    'deactivate': 'Ти бажаєшь деактивувати цю вакансію',
                },
                'confirm_user': {
                    'create': 'Ти бажаєш створити нову вакансію',
                    'update': 'Ти бажаєш змінити цю вакансію',
                    'activate': 'Ти бажаєш активувати цю вакансію',
                    'deactivate': 'Ти бажаєш деактивувати цю вакансію',
                    'delete': 'Ти бажаєш назавжди видалити цю вакансію',
                    'complaint': 'Ти бажаєш поскаржитися на цю вакансію',
                    'error': {
                        'first_name': 'Щоб створити вакансію, тобі необхідно додати своє ім\'я',
                    }
                },
            },
            'callback': {
                'show': {
                    'activate': 'Вакансію активовано',
                    'deactivate': 'Вакансію деактивовано',
                },
                'favorite': {
                    'create': 'Вакансію додано в обране',
                    'delete': 'Вакансію прибрано з обраного',
                },
                'complaint': {
                    'create': 'Скаргу прийнято',
                },
                'delete': 'Вакансія видалена',
            },

            'post': {
                'bot': {
                    'caption': 'Telegram-бот',
                    'note': 'Якщо ти бажаєш створити нову вакансію або зробити свій пошук роботи більш гнучкішим, '
                            'тоді підлючайся до нашого Telegram-боту і роби це з максимальним комфортом.',
                },
                'chat': {
                    'caption': 'Telegram-чат',
                    'note': 'Підключайся до нашого Telegram-чату та вільно спілкуйтеся '
                            'або обговорюйте будь-які теми з іншими користувачами.',
                },
                'donate': {
                    'caption': 'Допомога проекту',
                    'note': 'Якщо у тебе є бажання підтримати цей проєкт для подальшого його процвітання, '
                            'ти можеш задонатити свої гроші за номером картки, вказаним нижче.',
                },
            },
        },

        'button': {
            'registration': {
                'contact': 'Надіслати свій номер',
            },

            'menu': {
                'catalog': 'Вакансії',
                'browse': 'Мої вакансії',
                'create': 'Створити вакансію',
                'favorite': 'Обране',
                'profile': 'Профіль',
                'about': 'Про мене',
                'support': 'Тех. підтримка',
                'admin': 'Адмін панель',
            },

            'profile': {
                'settings': 'Налаштування профілю',
                'name': {
                    'create': 'Додати ім\'я',
                    'change': 'Змінити ім\'я'
                }
            },

            'about': {
                'donate': 'Задонатити',
                'channel': 'Наш канал',
            },

            'admin': {
                'complaint': 'Порушення',
            },

            'vacancy': {
                'show': 'Подивитися',
                'blocked': 'Заблокувати користувача',
                'activate': 'Активувати',
                'deactivate': 'Деактивувати',
                'update': 'Змінити',
                'delete': 'Видалити',
                'nochange': 'Не змінювати',
                'city': 'Міста немає в списку',

                'favorite': {
                    'create': 'Додати в обране',
                    'delete': 'Прибрати з обраних',
                },
                'complaint': {
                    'create': 'Поскаржитися',
                },
                'employment': {
                    'complete': 'Повна',
                    'partial': 'Часткова',
                },
                'schedule': {
                    'stable': 'Стабільний',
                    'flexible': 'Гнучкий',
                },
                'choice': {
                    'yes': 'Так',
                    'not': 'Ні',
                },
            },

            'confirm': {
                'confirm_admin': {
                    'blocked': 'Заблокувати',
                    'activate': 'Активувати',
                    'deactivate': 'Деактивувати',
                },
                'confirm_user': {
                    'create': 'Створити',
                    'update': 'Змінити',
                    'activate': 'Активувати',
                    'deactivate': 'Деактивувати',
                    'delete': 'Видалити',
                    'complaint': 'Поскаржитися',
                },
            },

            'navigation': {
                'cancel': 'Скасувати',
                'back': 'Назад',
                'exit': 'Меню',
            },
        },

        'catalog': {
            'auto': {
                'name': 'Авто',
                'logo': '🏎️',
                'subcatalog': {
                    'electrician': 'Автоелектрик',
                    'tinkerer': 'Автожестянщик',
                    'painter': 'Автомаляр',
                    'mechanic': 'Автомеханік',
                    'wash': 'Автомийник',
                    'administrator': 'Адміністратор',
                    'engineer': 'Інженер-механік',
                    'restorer': 'Реставратор',
                    'tire': 'Шиномонтажник',
                    'other': 'Інше',
                },
            },
            'it': {
                'name': 'АйТі',
                'logo': '🖥',
                'subcatalog': {
                    'develop': 'Веб розробник',
                    'typesetter': 'Верстальник',
                    'cybersecurity': 'Кібербезпека',
                    'game': 'Розробник ігор',
                    'sysadmin': 'Системний адміністратор',
                    'analyst': 'Data аналітик',
                    'hrmanager': 'HR менеджер',
                    'tester': 'QA інженер',
                    'design': 'UI/UX дизайнер',
                    'other': 'Інше',
                },
            },
            'security': {
                'name': 'Безпека',
                'logo': '🛡️',
                'subcatalog': {
                    'guard': 'Охоронник',
                    'patrol': 'Патрульний',
                    'watchman': 'Сторож',
                    'other': 'Інше',
                },
            },
            'construction': {
                'name': 'Будівництво',
                'logo': '🧱',
                'subcatalog': {
                    'builder': 'Будівельник',
                    'foreman': 'Виконроб',
                    'electrician': 'Електрик',
                    'crane': 'Кранівник',
                    'painter': 'Маляр',
                    'fitter': 'Монтажник',
                    'bricklayer': 'Муляр',
                    'tiler': 'Плиточник',
                    'handyman': 'Різноробочий',
                    'plumber': 'Сантехнік',
                    'welder': 'Сварщик',
                    'carpenter': 'Столяр',
                    'facade': 'Фасадник',
                    'paver': 'Шляхоукладач',
                    'plasterer': 'Штукатур',
                    'other': 'Інше',
                },
            },
            'production': {
                'name': 'Виробництво',
                'logo': '🏭',
                'subcatalog': {
                    'foreman': 'Виконроб',
                    'driver': 'Водій підйомника',
                    'electrician': 'Електрик',
                    'assembler': 'Комплектувальник',
                    'designer': 'Конструктор',
                    'painter': 'Маляр',
                    'mechanic': 'Механік',
                    'installer': 'Монтажник',
                    'operator': 'Оператор ЧПУ',
                    'helper': 'Підсобник',
                    'welder': 'Сварщик',
                    'furniture': 'Складальник меблів',
                    'fitter': 'Слюсар',
                    'carpenter': 'Столяр',
                    'technologist': 'Технолог',
                    'turner': 'Токар',
                    'packer': 'Упаковщик',
                    'seamstress': 'Швачка',
                    'other': 'Інше',
                },
            },
            'armed': {
                'name': 'Збройні сили',
                'logo': '🔫',
                'subcatalog': {
                    'artillery': 'Артилерист',
                    'liaison': 'Зв\'язківець',
                    'antiaircraft': 'Зенітчик',
                    'commander': 'Командир',
                    'gunner': 'Кулеметник',
                    'mortar': 'Мінометник',
                    'operator': 'Оператор БПЛА',
                    'translator': 'Перекладач',
                    'pilot': 'Пілот',
                    'rocket': 'Ракетник',
                    'scout': 'Розвідник',
                    'sapper': 'Сапер',
                    'tanker': 'Танкіст',
                    'encryptor': 'Шифрувальник',
                    'navigator': 'Штурман',
                    'other': 'Інше',
                },
            },
            'beauty': {
                'name': 'Краса',
                'logo': '💄',
                'subcatalog': {
                    'administrator': 'Адміністратор',
                    'cosmetologist': 'Косметолог',
                    'master': 'Майстер',
                    'masseur': 'Масажист',
                    'barber': 'Перукар',
                    'trainer': 'Фітнес тренер',
                    'other': 'Інше',
                },
            },
            'culture': {
                'name': 'Культура',
                'logo': '🎨',
                'subcatalog': {
                    'actor': 'Актор',
                    'librarian': 'Бібліотекар',
                    'gallerist': 'Галерист',
                    'cultural': 'Культуролог',
                    'historian': 'Мистецтвознавець',
                    'museologist': 'Музеєзнавець',
                    'musician': 'Музикант',
                    'screenwriter': 'Сценарист',
                    'dancer': 'Танцюрист',
                    'filmmaker': 'Режисер',
                    'restorer': 'Реставратор',
                    'choreographer': 'Хореограф',
                    'other': 'Інше',
                },
            },
            'logistic': {
                'name': 'Логістика',
                'logo': '📦',
                'subcatalog': {
                    'loader': 'Вантажник',
                    'driver': 'Водій',
                    'trucker': 'Далекобійник',
                    'dispatcher': 'Диспетчер',
                    'forwarder': 'Експедитор',
                    'storekeeper': 'Комірник',
                    'courier': 'Кур\'єр',
                    'taxi': 'Таксист',
                    'other': 'Інше',
                },
            },
            'medicine': {
                'name': 'Медицина',
                'logo': '💊',
                'subcatalog': {
                    'administrator': 'Адміністратор',
                    'anesthesiologist': 'Анастезіолог',
                    'veterinarian': 'Ветеринар',
                    'gynecologist': 'Гінеколог',
                    'nurse': 'Медсестра',
                    'ophthalmologist': 'Окуліст',
                    'dentist': 'Стоматолог',
                    'pharmacist': 'Фармацевт',
                    'surgeon': 'Хірург',
                    'other': 'Інше',
                },
            },
            'sea': {
                'name': 'Море',
                'logo': '⚓️',
                'subcatalog': {
                    'bosun': 'Боцман',
                    'electrician': 'Електромеханік',
                    'captain': 'Капітан',
                    'crane': 'Кранівник',
                    'crewing': 'Крюїнг-менеджер',
                    'seaman': 'Матрос',
                    'engineer': 'Механік',
                    'motorman': 'Моторист',
                    'cook': 'Повар',
                    'refrigerator': 'Рефмеханік',
                    'fitter': 'Слюсар',
                    'officer': 'Судновод',
                    'supervisor': 'Супервайзер',
                    'other': 'Інше',
                },
            },
            'estate': {
                'name': 'Нерухомість',
                'logo': '🏠',
                'subcatalog': {
                    'broker': 'Брокер',
                    'sales': 'Менеджер з продажу',
                    'realtor': 'Ріелтор',
                    'other': 'Інше',
                },
            },
            'staff': {
                'name': 'Обслуговування',
                'logo': '🍹',
                'subcatalog': {
                    'administrator': 'Адміністратор',
                    'barista': 'Бариста',
                    'barman': 'Бармен',
                    'pastry': 'Кондитер',
                    'griller': 'Мангальщик',
                    'waiter': 'Офіціант',
                    'pizza': 'Пиццмейкер',
                    'cook': 'Повар',
                    'maid': 'Покоївка',
                    'cleaner': 'Прибиральниця',
                    'sushi': 'Сушист',
                    'other': 'Інше',
                },
            },
            'education': {
                'name': 'Освіта',
                'logo': '📚',
                'subcatalog': {
                    'teacher': 'Викладач',
                    'educator': 'Вихователь',
                    'tutor': 'Репетитор',
                    'other': 'Інше',
                },
            },
            'service': {
                'name': 'Послуги',
                'logo': '🧰',
                'subcatalog': {
                    'lawyer': 'Адвокат',
                    'animator': 'Аніматор',
                    'videographer': 'Відеоограф',
                    'carer': 'Доглядальниця',
                    'cynologist': 'Кінолог',
                    'repairman': 'Майстер із ремонту',
                    'nanny': 'Няня',
                    'psychologist': 'Психолог',
                    'secretary': 'Секретар',
                    'toastmaster': 'Тамада',
                    'travel': 'Туристичний агент',
                    'photographer': 'Фотограф',
                    'jurist': 'Юрист',
                    'other': 'Інше',
                },
            },
            'advertising': {
                'name': 'Реклама',
                'logo': '📻',
                'subcatalog': {
                    'buyer': 'Веб майстер',
                    'designer': 'Дизайнер',
                    'content': 'Контент-менеджер',
                    'copywriter': 'Копірайтер',
                    'marketer': 'Маркетолог',
                    'promoter': 'Промоутер',
                    'prmanager': 'PR менеджер',
                    'ssmanager': 'SSM фахівець',
                    'other': 'Інше',
                },
            },
            'agriculture': {
                'name': 'Сільське господарство',
                'logo': '🌱',
                'subcatalog': {
                    'agronomist': 'Агроном',
                    'viticulturist': 'Виноградар',
                    'soil': 'Ґрунтознавець',
                    'vegetable': 'Овочівник',
                    'breeder': 'Рослинник',
                    'gardener': 'Садівник',
                    'livestock': 'Тваринник',
                    'technologist': 'Технолог',
                    'tractor': 'Тракторист',
                    'florist': 'Флорист',
                    'other': 'Інше',
                },
            },
            'telecom': {
                'name': 'Телекомунікація',
                'logo': '📡',
                'subcatalog': {
                    'call': 'Оператор колл-центру',
                    'chat': 'Оператор чату',
                    'other': 'Інше',
                },
            },
            'trade': {
                'name': 'Торгівля',
                'logo': '🛒',
                'subcatalog': {
                    'administrator': 'Адміністратор',
                    'cashier': 'Касир',
                    'department': 'Керівник відділу продажів',
                    'sales': 'Менеджер з продажу',
                    'store': 'Менеджер інтернет магазину',
                    'customer': 'Менеджер по роботі з клієнтами',
                    'merchandiser': 'Мерчендайзер',
                    'salesman': 'Продавець',
                    'consultant': 'Продавець-консультант',
                    'supervisor': 'Супервайзер',
                    'commodity': 'Товарознавець',
                    'florist': 'Флорист',
                    'other': 'Інше',
                },
            },
            'finance': {
                'name': 'Фінанси',
                'logo': '💰',
                'subcatalog': {
                    'banker': 'Банкір',
                    'analyst': 'Бізнес-аналітик',
                    'accountant': 'Бухгалтер',
                    'economist': 'Економіст',
                    'cashier': 'Касир',
                    'crisis': 'Кризовий менеджер',
                    'insurance': 'Страховий агент',
                    'financier': 'Фінансист',
                    'jurist': 'Юрист',
                    'other': 'Інше',
                },
            },
        },

        'country': {
            'uk': {
                'name': 'Україна',
                'flag': '🇺🇦',
                'region': {
                    'vinnytsia': {
                        'name': 'Вінницька',
                        'city': {
                            'vinnytsia': 'Вінниця',
                            'zhmerynka': 'Жмеринка',
                            'mogilev': 'Могилів-Подільський',
                            'khmelnyk': 'Хмільник',
                        },
                    },
                    'volyn': {
                        'name': 'Волинська',
                        'city': {
                            'vladimir': 'Володимир',
                            'kovel': 'Ковель',
                            'lutsk': 'Луцьк',
                            'novovolynsk': 'Нововолинськ',
                        },
                    },
                    'dnipropetrovsk': {
                        'name': 'Дніпропетровська',
                        'city': {
                            'dnieper': 'Дніпро',
                            'zhovti': 'Жовті Води',
                            'kamenskoye': 'Кам\'янське',
                            'krivoy': 'Кривий Ріг',
                            'manganets': 'Марганець',
                            'nikopol': 'Нікополь',
                            'novomoskovsk': 'Новомосковськ',
                            'pokrov': 'Покров',
                            'pavlograd': 'Павлоград',
                            'sinelnikovo': 'Синельникове',
                        },
                    },
                    'donetsk': {
                        'name': 'Донецька',
                        'city': {
                            'avdeevka': 'Авдіївка',
                            'bakhmut': 'Бахмут',
                            'gorlovka': 'Горлівка',
                            'donetsk': 'Донецьк',
                            'druzhkovka': 'Дружківка',
                            'yenakievo': 'Єнакієве',
                            'konstantinovka': 'Костянтинівка',
                            'kramatorsk': 'Краматорськ',
                            'makeevka': 'Макіївка',
                            'mariupol': 'Маріуполь',
                            'slavyansk': 'Слов\'янськ',
                            'snezhnoye': 'Сніжне',
                            'chistyakovo': 'Чистякове',
                            'toretsk': 'Торецк',
                            'khartsyzk': 'Харцизьк',
                            'shakhtersk': 'Шахтарськ',
                            'yasinovataya': 'Ясинувата',
                        },
                    },
                    'zakarpattia': {
                        'name': 'Закарпатська',
                        'city': {
                            'beregovo': 'Берегове',
                            'vinogradov': 'Виноградів',
                            'irshava': 'Іршава',
                            'mukachevo': 'Мукачево',
                            'uzhgorod': 'Ужгород',
                            'khust': 'Хуст',
                        },
                    },
                    'zaporizhia': {
                        'name': 'Запорізька',
                        'city': {
                            'berdyansk': 'Бердянськ',
                            'zaporozhye': 'Запоріжжя',
                            'melitopol': 'Мелітополь',
                            'tokmak': 'Токмак',
                            'energodar': 'Енергодар',
                        },
                    },
                    'zhytomyr': {
                        'name': 'Житомирська',
                        'city': {
                            'berdichev': 'Бердичів',
                            'zhytomyr': 'Житомир',
                            'korosten': 'Коростень',
                            'novograd': 'Новоград-Волинський',
                        },
                    },
                    'frankivsk': {
                        'name': 'Івано-Франківська',
                        'city': {
                            'frankivsk': 'Івано-Франківськ',
                            'kalush': 'Калуш',
                            'kolomyia': 'Коломия',
                        },
                    },
                    'kiev': {
                        'name': 'Київська',
                        'city': {
                            'church': 'Біла Церква',
                            'boryspil': 'Бориспіль',
                            'boyarka': 'Боярка',
                            'brovary': '	Бровари',
                            'bucha': 'Буча',
                            'vasilkov': 'Василькíв',
                            'vishnevoye': 'Вишневе',
                            'vyshgorod': 'Вишгород',
                            'irpen': 'Ірпінь',
                            'kiev': 'Київ',
                            'obukhov': 'Обухів',
                            'slavutich': 'Славутич',
                            'fastov': 'Фастів',
                        },
                    },
                    'kirovohrad': {
                        'name': 'Кіровоградська',
                        'city': {
                            'alexandria': 'Олександрія',
                            'kropivnitsky': 'Кропивницький',
                            'svetlovodsk': 'Світловодськ',
                        },
                    },
                    'lviv': {
                        'name': 'Львівська',
                        'city': {
                            'boryslav': 'Борислав',
                            'drohobych': 'Дрогобич',
                            'lviv': 'Львів',
                            'novoyavorovsk': 'Новояворівськ',
                            'sambor': 'Самбір',
                            'stryj': 'Стрий',
                            'chervonograd': 'Червоноград',
                        },
                    },
                    'luhansk': {
                        'name': 'Луганська',
                        'city': {
                            'alchevsk': 'Алчевськ',
                            'anthracite': 'Антрацит',
                            'bryanka': 'Брянка',
                            'sorokino': 'Сорокине',
                            'khrustalny': 'Хрустальний',
                            'lisichansk': 'Лисичанськ',
                            'lugansk': 'Луганськ',
                            'pervomaysk': 'Первомайськ',
                            'rovenky': 'Ровеньки',
                            'rubizhne': 'Рубіжне',
                            'sverdlovsk': 'Довжанськ',
                            'severodonetsk': 'Сєвєродонецьк',
                            'stakhanov': 'Кадіївка',
                        },
                    },
                    'mykolaiv': {
                        'name': 'Миколаївська',
                        'city': {
                            'voznesensk': 'Вознесенськ',
                            'mykolaiv': 'Миколаїв',
                            'pervomaysk': 'Первомайськ',
                            'yuzhnoukrainsk': 'Южноукраїнськ',
                        },
                    },
                    'odessa': {
                        'name': 'Одеська',
                        'city': {
                            'belgorod': 'Білгород-Дністровський',
                            'izmail': 'Ізмаїл',
                            'odessa': 'Одеса',
                            'podolsk': 'Подільськ',
                            'chernomorsk': 'Чорноморськ',
                            'yuzhnoye': 'Южне',
                        },
                    },
                    'poltava': {
                        'name': 'Полтавська',
                        'city': {
                            'plavni': 'Горішні Плавні',
                            'kremenchug': 'Кременчук',
                            'lubny': 'Лубни',
                            'mirgorod': 'Миргород',
                            'poltava': 'Полтава',
                        },
                    },
                    'rivne': {
                        'name': 'Рівненська',
                        'city': {
                            'dubno': 'Дубно',
                            'kostopol': 'Костопіль',
                            'varasch': 'Вараш',
                            'rivne': 'Рівне',
                        },
                    },
                    'sumy': {
                        'name': 'Сумська',
                        'city': {
                            'ochtirka': 'Охтирка',
                            'glukhov': 'Глухів',
                            'konotop': 'Конотоп',
                            'romney': 'Ромни',
                            'sumy': 'Суми',
                            'shostka': 'Шостка',
                        },
                    },
                    'ternopil': {
                        'name': 'Тернопільська',
                        'city': {
                            'kremenets': 'Кременець',
                            'ternopil': 'Тернопіль',
                            'chortkiv': 'Чортків',
                        },
                    },
                    'kharkiv': {
                        'name': 'Харківська',
                        'city': {
                            'izyum': 'Ізюм',
                            'lozovaya': 'Лозова',
                            'pervomayskiy': 'Первомайський',
                            'kharkiv': 'Харків',
                            'chuguev': 'Чугуїв',
                        },
                    },
                    'kherson': {
                        'name': 'Херсонська',
                        'city': {
                            'alyoshki': 'Олешки',
                            'kakhovka': 'Каховка',
                            'novaya': 'Нова Каховка',
                            'kherson': 'Херсон',
                        },
                    },
                    'khmelnytskyi': {
                        'name': 'Хмельницька',
                        'city': {
                            'podilskyi': 'Кам\'янець-Подільський',
                            'neteszyn': 'Нетішин',
                            'slavuta': 'Славута',
                            'starokonstantinov': 'Старокостянтинів',
                            'kmelnytskyi': 'Хмельницький',
                            'shepetivka': 'Шепетівка',
                        },
                    },
                    'cherkasy': {
                        'name': 'Черкаська',
                        'city': {
                            'zolotonosha': 'Золотоноша',
                            'smela': 'Сміла',
                            'uman': 'Умань',
                            'cherkasy': 'Черкаси',
                        },
                    },
                    'chernivtsi': {
                        'name': 'Чернівецька',
                        'city': {
                            'novodnestrovsk': 'Новодністровськ',
                            'storozyniec': 'Сторожинець',
                            'chernivtsi': 'Чернівці',
                        },
                    },
                    'chernihiv': {
                        'name': 'Чернігівська',
                        'city': {
                            'nizhyn': 'Ніжин',
                            'priluki': 'Прилуки',
                            'chernigov': 'Чернігів',
                        },
                    },
                },
            },
        },
    },
}
