connector = {
    'uk': {
        'start_message': '# ###   Ласкаво просимо!   ### #',

        'informer': {
            'menu': 'Ласкаво просимо до головного меню!',
            'catalog': 'Оберіть категорію вашої професії:',
            'subcatalog': 'Оберіть, ким ви бажаете працювати:',
            'browse': 'Ви не створили ще не обнієї вакансії!',
            'create': 'Бажаєшь створити нову вакансію? Я тобі допоможу!',
            'favorite': 'В тебе поки що не має уподобань(',
            'profile': 'Твій особистий профіль!',
            'about': 'Це інформація о том, хто створив цей бот!',
            'support': 'Я можу тобі чимось допомогти?',
        },

        'catalog': {
            'construction': {
                'name': 'Будівництво',
                'logo': '🧱',
                'subcatalog': {
                    'cranes_man': 'Кранівник',
                    'tiler': 'Плиточник',
                    'fitter': 'Монтажник',
                    'welder': 'Зварювальник',
                    'painter': 'Маляр',
                    'plumber': 'Сантехнік',
                    'facade_man': 'Фасадник',
                    'plasterer': 'Штукатур',
                    'electrician': 'Електрик',
                    'other': 'Інше',
                },
            },
            'medical': {
                'name': 'Медицина',
                'logo': '💊',
                'subcatalog': {
                    'nurse': 'Медсестра',
                    'dentist': 'Стоматолог',
                    'pharmacist': 'Фармацевт',
                    'veterinarian': 'Ветеринар',
                    'other': 'Інше',
                },
            },
            'it': {
                'name': 'АйТі',
                'logo': '🖥',
                'subcatalog': {
                    'sysadmin': 'Сис. Админ',
                    'operator': 'Оператор ПК',
                    'developer': 'Веб Розробник',
                    'gamedev': 'Розробник ігор',
                    'repairman': 'Мастер з ремонту',
                    'other': 'Інше',
                },
            },
            'finances': {
                'name': 'Банкінг',
                'logo': '💰',
                'subcatalog': {
                    'lawyer': 'Юрист',
                    'other': 'Інше',
                },
            },
            'realestate': {
                'name': 'Нерухомість',
                'logo': '🏠',
                'subcatalog': {
                    'realtor': 'Ріелтор',
                    'broker': 'Брокер',
                    'other': 'Інше',
                },
            },
        },

        'button': {
            'contact': '📱 Мій номер',
            'menu': {
                'catalog': '🗃️ Оголошення',
                'browse': '📌 Мои оголошення',
                'create': '🆕 Створити оголошення',
                'favorites': '⭐️ Обране',
                'profile': '🧑‍💻 Профіль',
                'about': 'ℹ️ Про нас',
                'support': '⚙️ Тех. підтримка',
            },
            'skip': 'Пропустити',
            'yes': 'Так',
            'not': 'Ні',
            'back': 'Назад',
            'exit': 'Вихід',
            'create': 'Создать',
        },

        'message': {
            'authorized': 'Вы вже є у системі.',
            'contact': 'Дуже добре! Мы тебе зареєстрували у системі.',
        },

        'country': {
            'ukraine': {
                'name': 'Україна',
                'region': {
                    'kiev': {
                        'name': 'Києвська',
                        'city': {
                            'kiev': 'Києв',
                        },
                    },
                    'odessa': {
                        'name': 'Одеська',
                        'city': {
                            'odessa': 'Одеса',
                            'izmail': 'Ізмаїл',
                            'southern': 'Южний',
                            'chernomorsk': 'Черноморськ',
                            'sarata': 'Сарата',
                        },
                    },
                    'nikolajev': {
                        'name': 'Миколаївська',
                        'city': {
                            'nikolajev': 'Миколаїв',
                            'ochakov': 'Очаків',
                        },
                    },
                    'lviv': {
                        'name': 'Львівська',
                        'city': {
                            'lviv': 'Львів',
                        },
                    },
                    'vinnytsia': {
                        'name': 'Вінницька',
                        'city': {
                            'vinnytsia': 'Вінниця',
                        },
                    },
                },
            },
        },
    },
}
