json = {
    'ua': {
        'language': {
            'ua': {
                'name': 'Українська',
                'flag': '🇺🇦',
            },
        },

        'informer': {
            'menu': 'Ласкаво просимо до головного меню!',
            'catalog': 'Оберіть категорію вашої професії:',
            'subcatalog': 'Оберіть, ким ви бажаете працювати:',
            'read': 'Ви не створили ще не обнієї вакансії!',
            'create': 'Бажаєшь створити нову вакансію? Я тобі допоможу!',
            'favorite': 'В тебе поки що не має уподобань(',
            'profile': 'Твій особистий профіль!',
            'about': 'Це інформація о том, хто створив цей бот!',
            'support': 'Я можу тобі чимось допомогти?',
        },

        'currency': {
            'ua': {
                'name': 'Українська гривня',
                'abbreviation': 'UAH',
                'flag': '🇺🇦',
            },
        },

        'country': {
            'ua': {
                'name': 'Україна',
                'flag': '🇺🇦',
                'region': {
                    'kiev': {
                        'name': 'Києвська',
                        'city': {
                            'kiev': 'Києв',
                        },
                    },
                    'odessa': {
                        'name': 'Одеська',
                        'city': {
                            'odessa': 'Одеса',
                            'izmail': 'Ізмаїл',
                            'southern': 'Южний',
                            'chernomorsk': 'Черноморськ',
                            'sarata': 'Сарата',
                        },
                    },
                    'nikolajev': {
                        'name': 'Миколаївська',
                        'city': {
                            'nikolajev': 'Миколаїв',
                            'ochakov': 'Очаків',
                        },
                    },
                    'lviv': {
                        'name': 'Львівська',
                        'city': {
                            'lviv': 'Львів',
                        },
                    },
                    'vinnytsia': {
                        'name': 'Вінницька',
                        'city': {
                            'vinnytsia': 'Вінниця',
                        },
                    },
                },
            },
        },

        'catalog': {
            'medicine': {
                'name': 'Медицина',
                'sub_name': {
                    'nurse': 'Медсестра',
                    'dentist': 'Стоматолог',
                    'pharmacist': 'Фармацевт',
                    'veterinarian': 'Ветеринар',
                    'other': 'Інше',
                },
            },
            'it': {
                'name': 'IT',
                'sub_name': {
                    'sysadmin': 'Сис. Админ',
                    'developer': 'Розробник',
                    'gamedev': 'Розробник ігор',
                    'other': 'Інше',
                },
            },
            'banking': {
                'name': 'Банкінг',
                'sub_name': {
                    'lawyer': 'Юрист',
                    'other': 'Інше',
                },
            },
            'property': {
                'name': 'Нерухомість',
                'sub_name': {
                    'realtor': 'Ріелтор',
                    'broker': 'Брокер',
                    'other': 'Інше',
                },
            },
            'advertisement': {
                'name': 'Реклама',
                'sub_name': {
                    'promoter': 'Промоутер',
                    'designer': 'Дизайнер',
                    'marketer': 'Маркетолог',
                    'copywriter': 'Копірайтер',
                    'other': 'Інше',
                },
            },
        },

        'schedule': {
            'complete': 'Полный рабочий день',
            'incomplete': 'Не полный рабочий день',
            'shift': 'Вахтовый график',
            'rotating': 'Сменный график',
            'flexible': 'Гибкий график',
            'remote': 'Удалённая работа',
            'schedule_all': 'Выбрать всё'
        },

        'employment': {
            'full': 'Полная занятость',
            'seasonal': 'Сезонная работа',
            'partial': 'Частичная занятость',
            'internship': 'Стажировка',
            'part_time': 'Подработка',
        },

        'expertise': {
            'inexperienced': 'Без опыта',
            'one_to': 'Меньше 1 года',
            'one_to_three': 'от 1 до 3 лет',
            'three_to_six': 'от 3 до 6 лет',
            'from_six': 'более 6 лет',
        },

        'button': {
            'menu': {
                'catalog': '🗃️ Оголошення',
                'browse': '📌 Мои оголошення',
                'create': '🆕 Створити оголошення',
                'favorites': '⭐️ Обране',
                'profile': '🧑‍💻 Профіль',
                'about': 'ℹ️ Про нас',
                'support': '⚙️ Тех. підтримка',
            },
            'contact': '📱 Мій номер',
            'back': 'Назад',
            'exit': 'Вихід',
            'create': 'Создать',
        },

        'message': {
            'start_msg': 'Ласкаво просымо на wAdsWork!\n'
                         'Обери мову спілкування:',
            'language_msg': 'Добре! Ти вибрав українську мову!\n'
                            'Тепер напиши нам свій номер телефону або просто відправ.',
        },
    },
}
